[
  {
    "title": "How did you validate your startup idea before building?",
    "content": "I'm curious about the steps you took to make sure your idea had real demand before investing time and money.",
    "subreddit": "startups"
  },
  {
    "title": "What are the biggest challenges you faced in your first year?",
    "content": "As a founder just starting out, I'd love to hear stories about common pitfalls and how you overcame them.",
    "subreddit": "startups"
  },
  {
    "title": "What’s one thing you wish you knew before becoming an entrepreneur?",
    "content": "Looking back, what advice would you give to your younger self before starting your business journey?",
    "subreddit": "entrepreneur"
  },
  {
    "title": "What tools did you use to build your MVP quickly?",
    "content": "Speed is crucial for MVPs. Share your favorite platforms or tools that helped you launch fast.",
    "subreddit": "mvp"
  },
  {
    "title": "Best practices for launching a new product online?",
    "content": "For those who’ve done a product launch, what channels and tactics worked best to gain traction?",
    "subreddit": "productlaunch"
  },
  {
    "title": "What’s your favorite productivity hack?",
    "content": "I recently started using the Pomodoro Technique and it's made a huge difference. What tips do you have for staying focused?",
    "subreddit": "Productivity"
  },
  {
    "title": "Can anyone recommend a good fantasy book series?",
    "content": "I'm looking for something new to read. I love epic world-building and strong character development.",
    "subreddit": "Books"
  },
  {
    "title": "First time visiting Japan, any travel tips?",
    "content": "I’m planning a two-week trip and would love advice on places to visit, local food to try, and cultural do's and don'ts.",
    "subreddit": "Travel"
  },
  {
    "title": "Beginner workout routines at home?",
    "content": "I want to start exercising but don’t have access to a gym. What are some good home workout routines for beginners?",
    "subreddit": "fitness"
  }
]
